---
kind: method
id: M:Autodesk.Revit.DB.ModelCurve.GetVisibility
source: html/a55d1378-8410-209e-20d2-f99dd88f3226.htm
---
# Autodesk.Revit.DB.ModelCurve.GetVisibility Method

Gets the visibility for the model curve in a family document.

## Syntax (C#)
```csharp
public FamilyElementVisibility GetVisibility()
```

## Returns
A copy of visibility settings for the model curve in a family document.